
## :white_check_mark: Apply Succeeded (account-data-deleter-cdk-dev)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/16345)



<pre><code>Apply complete! Resources: 1 added, 2 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.archive_file.batchdeletelambda_batch-delete-lambda_lambda-default-file_93768F47: Reading...
data.archive_file.event-consumer_sqs-event-consumer_lambda_lambda-default-file_2256A51A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.archive_file.batchdeletelambda_batch-delete-lambda_lambda-default-file_93768F47: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.archive_file.event-consumer_sqs-event-consumer_lambda_lambda-default-file_2256A51A: Read complete after 0s [id=2b764d3b21b3c9f088f043bc205556d3519be551]
data.terraform_remote_state.incident_management: Read complete after 1s
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=PUPKWBA]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=PQDZVMN]
aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_redrive_sqs_queue_05E61A7A: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Event-Consumer-Queue-Deadletter]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_assume-policy-document_399C5D83: Reading...
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Reading...
data.aws_caller_identity.caller: Reading...
aws_codedeploy_app.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-app_8782CBBF: Refreshing state... [id=f862754f-2bac-453e-8469-3fb97a91117f:AccountDataDeleter-Dev-Sqs-Event-Consumer-Lambda]
data.aws_sns_topic.backend_notifications: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_assume-policy-document_399C5D83: Read complete after 0s [id=1349007126]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_819DEF39: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-assume-role-policy-document_819DEF39: Read complete after 0s [id=4250039221]
data.aws_region.region: Reading...
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_caller_identity.caller: Read complete after 0s [id=410318598490]
data.aws_region.data-deleter-app_application_pocket_vpc_current_region_9BAA1E59: Reading...
data.aws_region.data-deleter-app_application_pocket_vpc_current_region_9BAA1E59: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_sentry-dsn_5C32B564: Reading...
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_vpc_ssm_param_4FF9713E: Reading...
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_vpc_ssm_param_4FF9713E: Read complete after 0s [id=/Shared/Vpc]
data.aws_ssm_parameter.pocket-vpc_private_subnets_75BAFB11: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:410318598490:Backend-Dev-ChatBot]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_public_subnets_FCE306F6: Reading...
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Reading...
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Critical]
aws_sqs_queue.batch-delete-consumer-queue_redrive_sqs_queue_B3F8A415: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Batch-Delete-Consumer-Queue-Deadletter]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_sentry-dsn_5C32B564: Read complete after 0s [id=/AccountDataDeleter/Dev/SENTRY_DSN]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_assume-policy-document_8DB23EF4: Reading...
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_assume-policy-document_8DB23EF4: Read complete after 0s [id=1349007126]
aws_s3_bucket.batchdeletelambda_batch-delete-lambda_code-bucket_1341E11E: Refreshing state... [id=pocket-accountdatadeleter-dev-batchdeletelambda]
data.aws_ssm_parameter.pocket-vpc_public_subnets_7F9CDB28: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Reading...
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_execution-policy-document_48A37D72: Reading...
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_public_subnets_FCE306F6: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_execution-policy-document_48A37D72: Read complete after 0s [id=2591764522]
aws_ecs_cluster.data-deleter-app_application_ecs_cluster_72BD4946: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:cluster/AccountDataDeleter-Dev]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-assume_F62BA8C5: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-assume_F62BA8C5: Read complete after 0s [id=1077804475]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_private_subnets_84F720F4: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Reading...
data.aws_region.pocket-vpc_current_region_1602AAD6: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.data-deleter-app_application_pocket_vpc_private_subnets_84F720F4: Read complete after 0s [id=/Shared/PrivateSubnets]
data.aws_region.data-deleter-app_application_ecs_service_ecs_codedeploy_current_region_C76CD263: Reading...
data.aws_caller_identity.data-deleter-app_application_pocket_vpc_current_identity_282F68FB: Reading...
data.aws_region.data-deleter-app_application_ecs_service_ecs_codedeploy_current_region_C76CD263: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Reading...
data.aws_caller_identity.data-deleter-app_application_pocket_vpc_current_identity_282F68FB: Read complete after 0s [id=410318598490]
aws_cloudwatch_log_group.data-deleter-app_app-log-group_AD731D31: Refreshing state... [id=/Backend/AccountDataDeleter-Dev/ecs/app]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_execution-policy-document_B8D98A18: Reading...
data.aws_kms_alias.pocket-vpc_secrets_manager_key_BF1637BF: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_execution-policy-document_B8D98A18: Read complete after 0s [id=2591764522]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_EDBA94BC: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_EDBA94BC: Read complete after 0s [id=4250039221]
data.aws_kms_alias.data-deleter-app_application_pocket_vpc_secrets_manager_key_76639B0A: Reading...
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_53EA38C8: Reading...
data.aws_iam_policy_document.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-assume-role-policy-document_53EA38C8: Read complete after 0s [id=4250039221]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_service-hash_868F8863: Reading...
data.aws_ssm_parameter.pocket-vpc_vpc_ssm_param_17802658: Read complete after 0s [id=/Shared/Vpc]
data.aws_ssm_parameter.batchdeletelambda_service-hash_4B4D1C4B: Reading...
data.aws_kms_alias.data-deleter-app_application_pocket_vpc_secrets_manager_key_76639B0A: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
data.aws_caller_identity.data-deleter-app_application_ecs_service_ecs_codedeploy_current_account_87CE4B60: Reading...
data.aws_kms_alias.kms_alias: Reading...
data.aws_caller_identity.data-deleter-app_application_ecs_service_ecs_codedeploy_current_account_87CE4B60: Read complete after 0s [id=410318598490]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 0s [id=PKAPG94]
aws_codedeploy_app.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-app_F69B4EF8: Refreshing state... [id=fceee71c-c660-4e26-8fe1-5ad77acbc7c5:AccountDataDeleter-Dev-BatchDeleteLambda-Lambda]
data.aws_ssm_parameter.batchdeletelambda_service-hash_4B4D1C4B: Read complete after 0s [id=/AccountDataDeleter/CircleCI/Dev/SERVICE_HASH]
aws_dynamodb_table.batchdeletelambda_HistoricalDeletedUsers-Pending_dynamodb_table_225C7A6D: Refreshing state... [id=ADD-HistoricalDeletedUsers-Pending]
data.aws_ssm_parameter.event-consumer_sqs-event-consumer_service-hash_868F8863: Read complete after 0s [id=/AccountDataDeleter/CircleCI/Dev/SERVICE_HASH]
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:410318598490:alias/aws/secretsmanager]
aws_route53_zone.data-deleter-app_application_base_dns_subhosted_zone_0A436834: Refreshing state... [id=Z058689626IKKLL6GJEUB]
aws_acm_certificate.data-deleter-app_application_alb_certificate_FD655806: Refreshing state... [id=arn:aws:acm:us-east-1:410318598490:certificate/158a133f-9e87-42b8-bb30-8f9fd9c03046]
aws_s3_bucket.event-consumer_sqs-event-consumer_lambda_code-bucket_484E6323: Refreshing state... [id=pocket-accountdatadeleter-dev-sqs-event-consumer]
aws_dynamodb_table.batchdeletelambda_HistoricalDeletedUsers-Processed_dynamodb_table_889BF31E: Refreshing state... [id=ADD-HistoricalDeletedUsers-Processed]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 0s [id=PZQ6AUS]
data.aws_route53_zone.data-deleter-app_application_base_dns_main_hosted_zone_47FDCB81: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Non-Critical]
data.aws_ssm_parameter.batchdeletelambda_sentry-dsn_262DD7F7: Reading...
aws_ecr_repository.data-deleter-app_application_ecs_service_ecr-app_ecr-repo_3026A62A: Refreshing state... [id=accountdatadeleter-dev-app]
data.aws_ssm_parameter.batchdeletelambda_sentry-dsn_262DD7F7: Read complete after 0s [id=/AccountDataDeleter/Dev/SENTRY_DSN]
aws_codedeploy_app.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_3F6E9850: Refreshing state... [id=c0d73baa-1a4e-4581-9de6-28f8a1eb276a:AccountDataDeleter-Dev-ECS]
aws_sqs_queue.event-consumer_user-events-sns-subscription_sns-topic-dql_64AC6C4E: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-SNS-Topic-DLQ]
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Reading...
data.aws_caller_identity.pocket-vpc_current_identity_8303C1C9: Read complete after 0s [id=410318598490]
aws_iam_role.event-consumer_sqs-event-consumer_lambda_execution-role_DF2EA7D3: Refreshing state... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-ExecutionRole]
aws_iam_role.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-role_09F928DA: Refreshing state... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-CodeDeployRole]
aws_sqs_queue.event-consumer_sqs-event-consumer_lambda_sqs_queue_01854365: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Event-Consumer-Queue]
data.aws_vpc.data-deleter-app_application_pocket_vpc_7062C2E1: Reading...
aws_iam_role.batchdeletelambda_batch-delete-lambda_execution-role_28D715FA: Refreshing state... [id=AccountDataDeleter-Dev-BatchDeleteLambda-ExecutionRole]
aws_sqs_queue.batch-delete-consumer-queue_sqs_queue_D3FD6851: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Batch-Delete-Consumer-Queue]
aws_iam_policy.batchdeletelambda_batch-delete-lambda_execution-policy_0CB4B8C7: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDataDeleter-Dev-BatchDeleteLambda-ExecutionRolePolicy]
data.aws_route53_zone.data-deleter-app_application_base_dns_main_hosted_zone_47FDCB81: Read complete after 1s [id=ZCSIDA846KWLN]
aws_iam_role.data-deleter-app_application_ecs_service_ecs-iam_ecs-execution-role_A0A8D414: Refreshing state... [id=AccountDataDeleter-Dev-TaskExecutionRole]
aws_iam_role.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-role_91290640: Refreshing state... [id=AccountDataDeleter-Dev-TaskRole]
aws_iam_policy.event-consumer_sqs-event-consumer_lambda_execution-policy_99388433: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDataDeleter-Dev-Sqs-Event-Consumer-ExecutionRolePolicy]
aws_iam_role.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-role_9D02E0E0: Refreshing state... [id=AccountDataDeleter-Dev-BatchDeleteLambda-CodeDeployRole]
aws_iam_role.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_C71A976C: Refreshing state... [id=AccountDataDeleter-Dev-ECSCodeDeployRole]
data.aws_vpc.pocket-vpc_2587E211: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_297BA29E: Reading...
aws_s3_bucket_ownership_controls.batchdeletelambda_batch-delete-lambda_code-bucket-ownership-controls_900DFC79: Refreshing state... [id=pocket-accountdatadeleter-dev-batchdeletelambda]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_297BA29E: Read complete after 0s [id=1398253173]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P5L7LR3]
aws_s3_bucket_public_access_block.batchdeletelambda_batch-delete-lambda_code-bucket-public-access-block_1A938E94: Refreshing state... [id=pocket-accountdatadeleter-dev-batchdeletelambda]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=P2OJKBD]
data.aws_iam_policy_document.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy-doc_BB5F5C92: Reading...
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=P9XVM3T]
data.aws_iam_policy_document.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy-doc_BB5F5C92: Read complete after 0s [id=1927231174]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PQ6GMFG]
aws_route53_record.data-deleter-app_application_alb_certificate_certificate_record_88681242: Refreshing state... [id=Z058689626IKKLL6GJEUB__a40afd8884085aeb407d929477d79a31.account-data-deleter-api.getpocket.dev._CNAME]
aws_sns_topic_subscription.event-consumer_user-events-sns-subscription_164DD4AB: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:PocketEventBridge-Dev-UserEventTopic:ccd06c1d-e39e-4264-b9e5-ba7be454f05b]
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-dlq-policy-document_F0C4881F: Reading...
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-dlq-policy-document_F0C4881F: Read complete after 0s [id=3281761693]
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-sqs-policy-document_A53F50B3: Reading...
data.aws_iam_policy_document.event-consumer_user-events-sns-subscription_sns-sqs-policy-document_A53F50B3: Read complete after 0s [id=3414048138]
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_sqs_policy_87BD2525: Reading...
data.aws_iam_policy_document.event-consumer_sqs-event-consumer_lambda_sqs_policy_87BD2525: Read complete after 0s [id=401209748]
aws_s3_bucket_public_access_block.event-consumer_sqs-event-consumer_lambda_code-bucket-public-access-block_AF8F837A: Refreshing state... [id=pocket-accountdatadeleter-dev-sqs-event-consumer]
aws_s3_bucket_ownership_controls.event-consumer_sqs-event-consumer_lambda_code-bucket-ownership-controls_10A070E1: Refreshing state... [id=pocket-accountdatadeleter-dev-sqs-event-consumer]
aws_ecr_lifecycle_policy.data-deleter-app_application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_0035C10E: Refreshing state... [id=accountdatadeleter-dev-app]
aws_route53_record.data-deleter-app_application_base_dns_subhosted_zone_ns_D71A4B22: Refreshing state... [id=ZCSIDA846KWLN_account-data-deleter-api.getpocket.dev_NS]
aws_iam_role_policy_attachment.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deploy-policy-attachment_DAFAA787: Refreshing state... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-CodeDeployRole-20220602014111979800000002]
aws_codestarnotifications_notification_rule.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_415EAA02: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:410318598490:notificationrule/a9c3c55b134915b3743480ca9d93deb62c1d02bc]
aws_codedeploy_deployment_group.event-consumer_sqs-event-consumer_lambda-code-deploy_code-deployment-group_25E98995: Refreshing state... [id=fa584e7d-326f-4dd7-817e-c90cf1b07be0]
aws_iam_role_policy_attachment.batchdeletelambda_batch-delete-lambda_execution-role-policy-attachment_2D695129: Refreshing state... [id=AccountDataDeleter-Dev-BatchDeleteLambda-ExecutionRole-20221110232847839700000002]
aws_iam_policy.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-execution-role-policy_B4FDF02D: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDataDeleter-Dev-TaskExecutionRolePolicy]
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_A007BDF5: Reading...
data.aws_iam_policy_document.data-deleter-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_A007BDF5: Read complete after 0s [id=2332717758]
aws_iam_role_policy_attachment.event-consumer_sqs-event-consumer_lambda_execution-role-policy-attachment_8D0214D0: Refreshing state... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-ExecutionRole-20220602014111945600000001]
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_1BBB86C3: Refreshing state... [id=AccountDataDeleter-Dev-TaskExecutionRole-20220602010817850800000009]
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_C5DC6D5A: Refreshing state... [id=AccountDataDeleter-Dev-ECSCodeDeployRole-2022060201081811080000000d]
aws_iam_policy.batchdeletelambda_BatchDeleteLambda-lambda-dynamo-policy_D7410D4B: Refreshing state... [id=arn:aws:iam::410318598490:policy/batchDeleteLambda-BatchDeleteLambda-DynamoLambdaPolicy]
data.aws_vpc.pocket-vpc_2587E211: Read complete after 0s [id=vpc-012481e83ffa5e152]
aws_ecs_task_definition.data-deleter-app_application_ecs_service_ecs-task_243DED07: Refreshing state... [id=AccountDataDeleter-Dev]
aws_iam_role_policy_attachment.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deploy-policy-attachment_70043CD9: Refreshing state... [id=AccountDataDeleter-Dev-BatchDeleteLambda-CodeDeployRole-20221110232847382000000001]
aws_codedeploy_deployment_group.batchdeletelambda_batch-delete-lambda_lambda-code-deploy_code-deployment-group_C5F30D1B: Refreshing state... [id=bede2d32-5152-4112-bf72-e079329c289b]
aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-dlq-policy_5F8E8B35: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-SNS-Topic-DLQ]
data.aws_vpc.data-deleter-app_application_pocket_vpc_7062C2E1: Read complete after 0s [id=vpc-012481e83ffa5e152]
aws_iam_policy.event-consumer_sqs-event-consumer_sqs-policy_F429D868: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDataDeleter-Dev-Sqs-Event-Consumer-LambdaSQSPolicy]
aws_sqs_queue_policy.event-consumer_user-events-sns-subscription_sns-sqs-policy_16608F07: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/410318598490/AccountDataDeleter-Dev-Sqs-Event-Consumer-Queue]
aws_s3_bucket_acl.batchdeletelambda_batch-delete-lambda_code-bucket-acl_5284C5E4: Refreshing state... [id=pocket-accountdatadeleter-dev-batchdeletelambda,private]
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_AAC29FFD: Refreshing state... [id=AccountDataDeleter-Dev-TaskExecutionRole-2022060201081811010000000c]
aws_iam_policy.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-role-policy_0A0BC3A4: Refreshing state... [id=arn:aws:iam::410318598490:policy/AccountDataDeleter-Dev-TaskRolePolicy]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Non-Critical:cc997eb8-6278-4916-bf07-cf8b747729b3]
aws_acm_certificate_validation.data-deleter-app_application_alb_certificate_certificate_validation_3E5D39F1: Refreshing state... [id=2022-06-02 01:08:57.143 +0000 UTC]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:410318598490:AccountDataDeleter-Dev-Infrastructure-Alarm-Critical:d685bb97-b093-46bb-8cab-0e2e6bbb184d]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Reading...
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Reading...
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Reading...
aws_s3_bucket_acl.event-consumer_sqs-event-consumer_lambda_code-bucket-acl_B144ED95: Refreshing state... [id=pocket-accountdatadeleter-dev-sqs-event-consumer,private]
local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09: Refreshing state... [id=001ffa7ab00555a1d9475431cd9875ae58340ddf]
data.aws_subnets.data-deleter-app_application_pocket_vpc_private_subnet_ids_47C2CFCD: Reading...
aws_alb_target_group.data-deleter-app_application_ecs_service_blue_target_group_ecs_target_group_283B74DF: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/ADDblu20220602010811606500000007/13d1088054f1ff64]
data.aws_security_groups.data-deleter-app_application_pocket_vpc_default_security_groups_A20BE21F: Reading...
data.aws_subnets.pocket-vpc_private_subnet_ids_73CCA71D: Read complete after 1s [id=us-east-1]
data.aws_security_groups.pocket-vpc_default_security_groups_1F0F3778: Read complete after 1s [id=us-east-1]
data.aws_security_groups.pocket-vpc_internal_security_groups_147262D8: Read complete after 1s [id=us-east-1]
aws_alb_target_group.data-deleter-app_application_ecs_service_green_target_group_ecs_target_group_2F7CE961: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:targetgroup/ADDgre20220602010810039000000003/19ae49abf478ad5f]
data.aws_subnets.pocket-vpc_public_subnet_ids_0B13AF23: Read complete after 1s [id=us-east-1]
data.aws_security_groups.data-deleter-app_application_pocket_vpc_internal_security_groups_49C5949A: Reading...
aws_security_group.data-deleter-app_application_application_load_balancer_alb_security_group_D3CF9597: Refreshing state... [id=sg-0ba1af06b876f93b3]
aws_iam_role_policy_attachment.batchdeletelambda_BatchDeleteLambda-execution-role-policy-attachment_C22EB886: Refreshing state... [id=AccountDataDeleter-Dev-BatchDeleteLambda-ExecutionRole-20221110232847927500000003]
data.aws_subnets.data-deleter-app_application_pocket_vpc_public_subnet_ids_020D43E9: Reading...
aws_iam_role_policy_attachment.event-consumer_sqs-event-consumer_execution-role-policy-attachment_64A8236E: Refreshing state... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-ExecutionRole-20220602014245064500000003]
aws_iam_role_policy_attachment.data-deleter-app_application_ecs_service_ecs-iam_ecs-task-custom-attachment_588622C1: Refreshing state... [id=AccountDataDeleter-Dev-TaskRole-2022060201081803850000000a]
aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C: Refreshing state... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-Function]
data.aws_subnets.data-deleter-app_application_pocket_vpc_private_subnet_ids_47C2CFCD: Read complete after 1s [id=us-east-1]
aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B: Refreshing state... [id=AccountDataDeleter-Dev-BatchDeleteLambda-Function]
data.aws_security_groups.data-deleter-app_application_pocket_vpc_internal_security_groups_49C5949A: Read complete after 0s [id=us-east-1]
data.aws_security_groups.data-deleter-app_application_pocket_vpc_default_security_groups_A20BE21F: Read complete after 0s [id=us-east-1]
data.aws_subnets.data-deleter-app_application_pocket_vpc_public_subnet_ids_020D43E9: Read complete after 0s [id=us-east-1]
aws_security_group.data-deleter-app_application_ecs_service_ecs_security_group_8AA7466D: Refreshing state... [id=sg-0da24ce9e57c6b3ab]
aws_alb.data-deleter-app_application_application_load_balancer_alb_1E12FF35: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:loadbalancer/app/ADD2022060201082001730000000f/527d38ea466e1872]
aws_lambda_alias.batchdeletelambda_batch-delete-lambda_alias_614E64AB: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:AccountDataDeleter-Dev-BatchDeleteLambda-Function:DEPLOYED]
aws_cloudwatch_log_group.batchdeletelambda_batch-delete-lambda_log-group_733861E0: Refreshing state... [id=/aws/lambda/AccountDataDeleter-Dev-BatchDeleteLambda-Function]
aws_lambda_alias.event-consumer_sqs-event-consumer_lambda_alias_7FEF0048: Refreshing state... [id=arn:aws:lambda:us-east-1:410318598490:function:AccountDataDeleter-Dev-Sqs-Event-Consumer-Function:DEPLOYED]
aws_cloudwatch_log_group.event-consumer_sqs-event-consumer_lambda_log-group_970CA206: Refreshing state... [id=/aws/lambda/AccountDataDeleter-Dev-Sqs-Event-Consumer-Function]
aws_alb_listener.data-deleter-app_application_listener_https_634EB75E: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/ADD2022060201082001730000000f/527d38ea466e1872/84a8cc0d9aedba89]
aws_route53_record.data-deleter-app_application_alb_record_3941D2F4: Refreshing state... [id=Z058689626IKKLL6GJEUB_account-data-deleter-api.getpocket.dev_A_1]
aws_alb_listener.data-deleter-app_application_listener_http_55B9BA83: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener/app/ADD2022060201082001730000000f/527d38ea466e1872/2db79728d5fcea58]
aws_cloudwatch_metric_alarm.data-deleter-app_application_alarm-httptarget5xxerrorrate_6FC46278: Refreshing state... [id=AccountDataDeleter-Dev-Alarm-HTTPTarget5xxErrorRate]
aws_lambda_event_source_mapping.event-consumer_sqs-event-consumer_lambda_event_source_mapping_DFCB2350: Refreshing state... [id=e41278b6-fc32-403f-8294-96e50f9ab7f3]
aws_alb_listener_rule.data-deleter-app_application_ecs_service_listener_rule_1E84FFF2: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:410318598490:listener-rule/app/ADD2022060201082001730000000f/527d38ea466e1872/84a8cc0d9aedba89/badd507cb5493658]
aws_ecs_service.data-deleter-app_application_ecs_service_ecs-service_CE3A63CF: Refreshing state... [id=arn:aws:ecs:us-east-1:410318598490:service/AccountDataDeleter-Dev/AccountDataDeleter-Dev]
aws_codedeploy_deployment_group.data-deleter-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_84B5DC1D: Refreshing state... [id=4f1cf4e6-5db4-4d69-b4ed-40c527dc3c87]
aws_cloudwatch_dashboard.data-deleter-app_application_cloudwatch-dashboard_E6D21985: Refreshing state... [id=AccountDataDeleter-Dev]
aws_appautoscaling_target.data-deleter-app_application_autoscaling_autoscaling_target_02FF0938: Refreshing state... [id=service/AccountDataDeleter-Dev/AccountDataDeleter-Dev]
aws_appautoscaling_policy.data-deleter-app_application_autoscaling_scale_in_policy_89E88BDA: Refreshing state... [id=AccountDataDeleter-Dev-ScaleInPolicy]
aws_appautoscaling_policy.data-deleter-app_application_autoscaling_scale_out_policy_B4560602: Refreshing state... [id=AccountDataDeleter-Dev-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.data-deleter-app_application_autoscaling_scale_in_alarm_E6DFF327: Refreshing state... [id=AccountDataDeleter-Dev Service Low CPU]
aws_cloudwatch_metric_alarm.data-deleter-app_application_autoscaling_scale_out_alarm_ECA6EBEC: Refreshing state... [id=AccountDataDeleter-Dev Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B will be updated in-place
  ~ resource "aws_lambda_function" "batchdeletelambda_batch-delete-lambda_9A38729B" {
        id                             = "AccountDataDeleter-Dev-BatchDeleteLambda-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:AccountDataDeleter-Dev-BatchDeleteLambda-Function:69" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:AccountDataDeleter-Dev-BatchDeleteLambda-Function:69/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Dev"
            "service"     = "AccountDataDeleter"
        }
      ~ version                        = "69" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"     = (sensitive value)
              + "NODE_ENV"    = "development"
                # (3 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C will be updated in-place
  ~ resource "aws_lambda_function" "event-consumer_sqs-event-consumer_lambda_2F35855C" {
        id                             = "AccountDataDeleter-Dev-Sqs-Event-Consumer-Function"
      ~ qualified_arn                  = "arn:aws:lambda:us-east-1:410318598490:function:AccountDataDeleter-Dev-Sqs-Event-Consumer-Function:113" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:410318598490:function:AccountDataDeleter-Dev-Sqs-Event-Consumer-Function:113/invocations" -> (known after apply)
        tags                           = {
            "environment" = "Dev"
            "service"     = "AccountDataDeleter"
        }
      ~ version                        = "113" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "GIT_SHA"                      = (sensitive value)
              + "NODE_ENV"                     = "development"
                # (3 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09 will be created
  + resource "local_file" "data-deleter-app_application_ecs_service_appspec_5FC42C09" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4015
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:410318598490:task-definition/AccountDataDeleter-Dev:87"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09: Creating...
local_file.data-deleter-app_application_ecs_service_appspec_5FC42C09: Creation complete after 0s [id=001ffa7ab00555a1d9475431cd9875ae58340ddf]
aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B: Modifying... [id=AccountDataDeleter-Dev-BatchDeleteLambda-Function]
aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C: Modifying... [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-Function]
aws_lambda_function.batchdeletelambda_batch-delete-lambda_9A38729B: Modifications complete after 7s [id=AccountDataDeleter-Dev-BatchDeleteLambda-Function]
aws_lambda_function.event-consumer_sqs-event-consumer_lambda_2F35855C: Modifications complete after 8s [id=AccountDataDeleter-Dev-Sqs-Event-Consumer-Function]
╷
│ Warning: Deprecated attribute
│ 
│   on cdk.tf.json line 3128, in resource.aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84:
│ 3128:         "endpoint": "https://events.pagerduty.com/integration/${pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5.integration_key}/enqueue",
│ 
│ The attribute "integration_key" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 3 more similar warnings elsewhere)
╵

Apply complete! Resources: 1 added, 2 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"99872056-7b98-4e54-93b4-14813728842b","JobName":"account-data-deleter_infrastructure_apply_dev","PRNumber":82,"Program":"tfcmt","SHA1":"87e8c50841e4d9f41f1dda17a268527ac74ddd49","Target":"account-data-deleter-cdk-dev","Vars":{}} -->